In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
os.chdir(r'C:\Users\lilie\Downloads\climate_change')
df = pd.read_csv('city_temperature.csv')
df.head()

C:\Users\lilie\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [4]:
df.isna().sum()

Region                  0
Country                 0
State             1450990
City                    0
Month                   0
Day                     0
Year                    0
AvgTemperature          0
dtype: int64

In [84]:
df.State.value_counts()
#missing states values because it's only concerning USA

Texas                     129711
Ohio                       64855
Florida                    61341
Pennsylvania               52076
New York                   46325
Michigan                   46325
California                 46325
Tennessee                  37060
Georgia                    37060
Colorado                   37060
Alabama                    37060
North Carolina             37060
Oregon                     37060
Illinois                   37060
Indiana                    37060
Louisiana                  33593
Kansas                     27795
Nebraska                   27795
Virginia                   27795
Missouri                   27795
Washington                 27795
Wisconsin                  27795
Alaska                     27795
Kentucky                   27795
Maryland                   27795
Montana                    27794
Arizona                    26484
South Dakota               18530
North Dakota               18530
Arkansas                   18530
Wyoming                    18530
Oklahoma                   18530
Iowa                       18530
West Virginia              18530
Minnesota                  18530
Maine                      18530
Nevada                     18530
South Carolina             18530
New Jersey                 18530
Mississippi                18530
Connecticut                18530
District of Columbia       18530
Idaho                      18530
New Hampshire               9265
Vermont                     9265
Utah                        9265
New Mexico                  9265
Hawaii                      9265
Rhode Island                9265
Massachusetts               9265
Additional Territories      6787
Delaware                    5751
Name: State, dtype: int64

In [32]:
df.loc[df.State.isna()]

,Region,Country,State,City,Month,Day,Year,AvgTemperature
1662774,North America,US,Delaware,Wilmington,1,1,1995,40.8
1662775,North America,US,Delaware,Wilmington,1,2,1995,36.8
1662776,North America,US,Delaware,Wilmington,1,3,1995,25.9
1662777,North America,US,Delaware,Wilmington,1,4,1995,30.1
1662778,North America,US,Delaware,Wilmington,1,5,1995,18.8
...,...,...,...,...,...,...,...,...
1668520,North America,US,Delaware,Wilmington,9,25,2010,80.4
1668521,North America,US,Delaware,Wilmington,9,26,2010,66.5
1668522,North America,US,Delaware,Wilmington,9,27,2010,69.3
1668523,North America,US,Delaware,Wilmington,9,28,2010,73.7
1668524,North America,US,Delaware,Wilmington,9,29,2010,64.8

In [34]:
df.Year.value_counts()

2000    119682
1999    119355
2001    119355
2002    119355
2003    119140
1998    119082
1996    118951
1997    118656
2004    118645
1995    118616
2005    117895
2006    117647
2010    115627
2007    115428
2008    114908
2009    114247
2011    113740
2012    111993
2013    111021
2014    109018
2015    107498
2016    107237
2017    106946
2018    106698
2019    106337
2020     38810
201        351
200         89
Name: Year, dtype: int64

In [172]:
df.shape

(2906327, 8)

In [5]:
#drop year 200 & year 201
row_to_drop = df.index[(df.Year==200) | (df.Year==201)]
row_to_drop

Int64Index([  58178,   58179,   58180,   58181,   58182,   58183,   58184,
              58185,   58186,   58187,
            ...
            1212422, 1212423, 1212424, 1212425, 1212426, 1212427, 1212428,
            1212429, 1212430, 1212431],
           dtype='int64', length=440)

In [6]:
df2 = df.copy()
df2.drop(row_to_drop, axis=0, inplace=True)
df2.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [7]:
df2.Year.value_counts()
#year is ok now

2000    119682
1999    119355
2001    119355
2002    119355
2003    119140
1998    119082
1996    118951
1997    118656
2004    118645
1995    118616
2005    117895
2006    117647
2010    115627
2007    115428
2008    114908
2009    114247
2011    113740
2012    111993
2013    111021
2014    109018
2015    107498
2016    107237
2017    106946
2018    106698
2019    106337
2020     38810
Name: Year, dtype: int64

In [91]:
df2.Region.value_counts()

North America                        1556652
Europe                                381695
Asia                                  316663
Africa                                251002
South/Central America & Carribean     219530
Middle East                           124749
Australia/South Pacific                55596
Name: Region, dtype: int64

In [92]:
df2.Country.value_counts()

US                   1455337
Canada                 74245
Australia              46330
China                  46329
India                  37063
                      ...
Guyana                  5065
Israel                  4641
Burundi                 4543
Georgia                 4378
Serbia-Montenegro       3427
Name: Country, Length: 125, dtype: int64

In [8]:
df2.columns

Index(['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year',
       'AvgTemperature'],
      dtype='object')

In [9]:
df2.Month.value_counts().sort_index(ascending=True)

1     252698
2     230401
3     252689
4     244491
5     247332
6     235530
7     243287
8     243177
9     235274
10    243022
11    235061
12    242925
Name: Month, dtype: int64

In [177]:
df2.Day.value_counts().sort_index(ascending=True)

0         8
1     95649
2     95654
3     95656
4     95655
5     95653
6     95653
7     95653
8     95653
9     95653
10    95652
11    95647
12    95644
13    95616
14    95355
15    95356
16    95352
17    95352
18    95351
19    95352
20    95349
21    95349
22    95349
23    95344
24    95344
25    95343
26    95345
27    95343
28    95344
29    89367
30    87335
31    55511
Name: Day, dtype: int64

In [10]:
#drop day 0
df2.drop(df2.index[(df2.Day==0)], axis=0, inplace=True)

In [11]:
df2.Day.value_counts().sort_index(ascending=True)
#now it's ok

1     95649
2     95654
3     95656
4     95655
5     95653
6     95653
7     95653
8     95653
9     95653
10    95652
11    95647
12    95644
13    95616
14    95355
15    95356
16    95352
17    95352
18    95351
19    95352
20    95349
21    95349
22    95349
23    95344
24    95344
25    95343
26    95345
27    95343
28    95344
29    89367
30    87335
31    55511
Name: Day, dtype: int64

In [12]:
df2.AvgTemperature.value_counts().sort_index(ascending=True)

-99.0     79224
-50.0         1
-49.1         1
-47.7         1
-46.9         1
          ...
 109.5        1
 109.7        1
 109.8        1
 109.9        4
 110.0        1
Name: AvgTemperature, Length: 1517, dtype: int64

In [ ]:
#about temperature (https://academic.udayton.edu/kissock/http/Weather/source.htm)
#The data fields in each file posted on this site are: month, day, year, average daily temperature (F).  
#We use "-99" as a no-data flag when data are not available.

# => drop -99 rows

In [13]:
df2.loc[df2.AvgTemperature==-99].Region.value_counts()

Africa                               30077
Europe                               12993
South/Central America & Carribean    12838
Asia                                 10500
North America                         8491
Middle East                           3938
Australia/South Pacific                387
Name: Region, dtype: int64

In [14]:
#drop avg temp = -99
df2.drop(df2.index[df2.AvgTemperature==-99], axis=0, inplace=True)

In [15]:
df2.AvgTemperature.value_counts().sort_index(ascending=True)
#it's ok now

-50.0     1
-49.1     1
-47.7     1
-46.9     1
-46.2     1
         ..
 109.5    1
 109.7    1
 109.8    1
 109.9    4
 110.0    1
Name: AvgTemperature, Length: 1516, dtype: int64

In [183]:
df2.shape

(2826655, 8)

In [16]:
# farenheit to celsius
#(T(°F) - 32) × 5/9
df2['AvgCelsiusTemp'] = [round((i-32)*(5/9),2) for i in df2.AvgTemperature]
df2.head()

,Region,Country,State,City,Month,Day,Year,AvgTemperature,AvgCelsiusTemp
0,Africa,Algeria,NaN,Algiers,1,1,1995,64.2,17.89
1,Africa,Algeria,NaN,Algiers,1,2,1995,49.4,9.67
2,Africa,Algeria,NaN,Algiers,1,3,1995,48.8,9.33
3,Africa,Algeria,NaN,Algiers,1,4,1995,46.4,8.00
4,Africa,Algeria,NaN,Algiers,1,5,1995,47.9,8.83

In [17]:
df2.drop('AvgTemperature', axis=1, inplace=True)

In [186]:
df2.head()

   Region  Country State     City  Month  Day  Year  AvgCelsiusTemp
0  Africa  Algeria   NaN  Algiers      1    1  1995           17.89
1  Africa  Algeria   NaN  Algiers      1    2  1995            9.67
2  Africa  Algeria   NaN  Algiers      1    3  1995            9.33
3  Africa  Algeria   NaN  Algiers      1    4  1995            8.00
4  Africa  Algeria   NaN  Algiers      1    5  1995            8.83

In [18]:
df2.AvgCelsiusTemp.value_counts().sort_index(ascending=True)

-45.56    1
-45.06    1
-44.28    1
-43.83    1
-43.44    1
         ..
 43.06    1
 43.17    1
 43.22    1
 43.28    4
 43.33    1
Name: AvgCelsiusTemp, Length: 1516, dtype: int64

In [19]:
df2.groupby(['Region','Year'])['AvgCelsiusTemp'].agg(['mean','min','max'])

                                             mean   min    max
Region                            Year
Africa                            1995  23.272240  4.67  37.67
                                  1996  23.085922  5.06  37.50
                                  1997  23.022888  5.78  37.78
                                  1998  23.193781  7.83  39.33
                                  1999  23.274549  2.56  37.33
...                                           ...   ...    ...
South/Central America & Carribean 2016  23.121594  3.06  33.56
                                  2017  23.009442  2.67  32.83
                                  2018  22.598388  2.22  34.50
                                  2019  22.887587  2.28  34.67
                                  2020  23.342595  5.00  32.50

[182 rows x 3 columns]

In [190]:
df2.to_csv(r'C:\Users\lilie\GitHubProjects\IronEstelle\project4_ClimateChange\Statistically_Significant_Insights\city_temp_cleaned.csv', index = False)

In [36]:
df.loc[df.Region=='South/Central America & Carribean'].Country.unique()

array(['Argentina', 'Bahamas', 'Bermuda', 'Belize', 'Bolivia', 'Barbados',
       'Brazil', 'Colombia', 'Costa Rica', 'Cuba', 'Dominican Republic',
       'Equador', 'Guatemala', 'Guyana', 'Haiti', 'Honduras', 'Nicaragua',
       'Panama', 'Peru', 'Suriname', 'Uruguay', 'Venezuela'], dtype=object)